Yr7/7-CS-JavaScript/resources/presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>An Introduction to JavaScript</title>
<meta name="author" content="(Marc Scott)"/>
<link rel="stylesheet" href="file:reveal.js/css/reveal.min.css"/>
<link rel="stylesheet" href="file:reveal.js/css/theme/Year7.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>An Introduction to JavaScript</h1>
<h2>Marc Scott</h2>
<h2><a href="mailto:"></a></h2>
<h2></h2></section>
<section>
<h2>Table of Contents</h2><ul>
<li>
<a href="#sec-1">Lesson 1</a>
<ul>
<li>
<a href="#sec-1-1">Message Boxes</a>
<ul>
<li>
<a href="#sec-1-1-1">Alert</a>
</li>
<li>
<a href="#sec-1-1-2">Prompt</a>
</li>
<li>
<a href="#sec-1-1-3">Confirms</a>
</li>
</ul>
<li>
<a href="#sec-1-2">Variables</a>
</li>
<li>
<a href="#sec-1-3">Strings</a>
</li>
<li>
<a href="#sec-1-4">Numbers</a>
</li>
<li>
<a href="#sec-1-5">Booleans</a>
</li>
</ul>
</section>

<section>
<section id="sec-1" >

<h2>Lesson 1</h2>
</section>
<section id="sec-1-1" >

<h3>Message Boxes</h3>
</section>
<section id="sec-1-1-1" >

<h4>Alert</h4>
<p>
Alerts can contain strings or variables or a mix of both
</p>
<div class="org-src-container">

<pre  class="src src-javascript">window.alert(<span style="color: #bdb76b;">'A message goes here'</span>)
window.alert(anyBVariableName)
window.alert(<span style="color: #bdb76b;">'You can mix text and '</span> + variableNames)
</pre>
</div>
</section>
<section id="sec-1-1-2" >

<h4>Prompt</h4>
<p>
Prompts will ask the user for a response. Remember to store a prompt as a variable, and that it will always be a string.
</p>
<div class="org-src-container">

<pre  class="src src-javascript">myVar = window.prompt(<span style="color: #bdb76b;">'This allows the user to type in a string'</span>)
myNum = window.prompt(<span style="color: #bdb76b;">"Even if they type numbers, they'll still be strings"</span>)
</pre>
</div>
</section>
<section id="sec-1-1-3" >

<h4>Confirms</h4>
<p>
Confirms will give the user a choice between OK and Cancel. These are then stored as a Boolean (see later on)
</p>
<div class="org-src-container">

<pre  class="src src-javascript">choice = window.confirm(<span style="color: #bdb76b;">'Choose OK or Cancel'</span>)
</pre>
</div>
</section>
<section id="sec-1-2" >

<h3>Variables</h3>
</section>
<section id="sec-1-3" >

<h3>Strings</h3>
</section>
<section id="sec-1-4" >

<h3>Numbers</h3>
</section>
<section id="sec-1-5" >

<h3>Booleans</h3>
</section>
</section>
</div>
</div>
<script src="file:reveal.js/lib/js/head.min.js"></script>
<script src="file:reveal.js/js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: false,
        			center: true,
                                slideNumber: true,
        			rollingLinks: false,
        			keyboard: true,
        			overview: true,
        			 // slide width
        			 // slide height
        			 // slide margin
        			 // slide minimum scaling factor
        			 // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: 'file:reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } }
        				,{ src: 'file:reveal.js/plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: 'file:reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: 'file:reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }
        				,{ src: 'file:reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }
        				,{ src: 'file:reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: 'file:reveal.js/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: 'file:reveal.js/plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
         				
        			]
        		});
</script>
</body>
</html>
